function [prediction, params, W] = TimeSeries(y,mode,varargin)
    % function
<<<<<<< HEAD
    %    °üº¬
    %
    % @param y:¹Û²âĞòÁĞ£¬ÁĞÏòÁ¿
    % @param mode£ºÔ¤²â·½·¨
    %       1 -> ¼òµ¥ÒÆ¶¯Æ½¾ù·¨
    %       2 -> 
    %
=======
    % @param y:è§‚æµ‹åºåˆ—ï¼Œåˆ—å‘é‡
    % @param modeï¼šé¢„æµ‹æ–¹æ³•
>>>>>>> f92c044ecdee66bf80d6b2c4905686b79504e842
    % @return
    % 
    prediction = 0;
    params = 0;
    W = 0;
    N = varargin(1);
    switch(mode)
        case 1
            disp("¼òµ¥ÒÆ¶¯Æ½¾ù·¨");
            prediction = MovingAverage(y);
        case 2
            disp("Ö¸ÊıÆ½»¬·¨");
            [prediction,params] = ExponentialSmoothing(y);
        case 3
            disp("²î·ÖÖ¸ÊıÆ½»¬·¨");
            prediction = DifferenceExponentialSmoothing(y);
        case 4
            disp("×ÔÊÊÓ¦ÂË²¨·¨");
            [prediction, W] = AdaptiveFiltering(y,N);
        otherwise
             disp("ÊäÈë²ÎÊı´íÎó");
    end
    
end

function prediction = MovingAverage(y)
    
<<<<<<< HEAD
%%%%%%%%%%%%   ¼òµ¥ÒÆ¶¯Æ½¾ù·¨  %%%%%%%%%%%%
%     ÊÊÓÃ·¶Î§£º
%           µ±Ô¤²âÄ¿±êµÄ»ù±¾Ç÷ÊÆÊÇÔÚÄ³Ò»Ë®Æ½ÉÏÏÂ²¨¶¯Ê±£¬¿ÉÓÃÒ»´Î¼òµ¥ÒÆ¶¯Æ½¾ù·½·¨½¨Á¢Ô¤²âÄ£ĞÍ
%           ¼òµ¥ÒÆ¶¯Æ½¾ù·¨Ö»ÊÊºÏ×ö½üÆÚÔ¤²â£¬¶øÇÒÊÇÔ¤²âÄ¿±êµÄ·¢Õ¹Ç÷ÊÆ±ä»¯²»´óµÄÇé¿ö¡£
%     ÓÅÈ±µã£º
%           Èç¹ûÄ¿±êµÄ·¢Õ¹Ç÷ÊÆ´æÔÚÆäËüµÄ±ä»¯£¬²ÉÓÃ¼òµ¥ÒÆ¶¯Æ½¾ù·¨¾Í»á²úÉú½Ï´óµÄÔ¤²âÆ«²îºÍÖÍºó¡£
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    % function£º¼òµ¥ÒÆ¶¯Æ½¾ù·¨
    %       ÊäÈë¹Û²ìĞòÁĞy£¬¼ÆËãÆ½ÒÆÏî N ÓÉ2µ½y³¤¶È2/3 µÄÔ¤²â½á¹û£¬ÒÀ¾İ¾ù·½²î×îĞ¡Ô­Ôò£¬Êä³ö×îÓÅ½â
=======
    %%%%%%%%   ç®€å•ç§»åŠ¨å¹³å‡æ³•  %%%%%%%%
    % é€‚ç”¨èŒƒå›´ï¼š
    %       å½“é¢„æµ‹ç›®æ ‡çš„åŸºæœ¬è¶‹åŠ¿æ˜¯åœ¨æŸä¸€æ°´å¹³ä¸Šä¸‹æ³¢åŠ¨æ—¶ï¼Œå¯ç”¨ä¸€æ¬¡ç®€å•ç§»åŠ¨å¹³å‡æ–¹æ³•å»ºç«‹é¢„æµ‹æ¨¡å‹
    %       ç®€å•ç§»åŠ¨å¹³å‡æ³•åªé€‚åˆåšè¿‘æœŸé¢„æµ‹ï¼Œè€Œä¸”æ˜¯é¢„æµ‹ç›®æ ‡çš„å‘å±•è¶‹åŠ¿å˜åŒ–ä¸å¤§çš„æƒ…å†µã€‚
    % ä¼˜ç¼ºç‚¹ï¼š
    %       å¦‚æœç›®æ ‡çš„å‘å±•è¶‹åŠ¿å­˜åœ¨å…¶å®ƒçš„å˜åŒ–ï¼Œé‡‡ç”¨ç®€å•ç§»åŠ¨å¹³å‡æ³•å°±ä¼šäº§ç”Ÿè¾ƒå¤§çš„é¢„æµ‹åå·®å’Œæ»åã€‚
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    % functionï¼šç®€å•ç§»åŠ¨å¹³å‡æ³•
    %       è¾“å…¥è§‚å¯Ÿåºåˆ—yï¼Œè®¡ç®—å¹³ç§»é¡¹ N ç”±2åˆ°yé•¿åº¦2/3 çš„é¢„æµ‹ç»“æœï¼Œä¾æ®å‡æ–¹å·®æœ€å°åŸåˆ™ï¼Œè¾“å‡ºæœ€ä¼˜è§£
>>>>>>> f92c044ecdee66bf80d6b2c4905686b79504e842
    %
    % @param y:è§‚æµ‹åºåˆ—ï¼Œåˆ—å‘é‡nx1
    %
    % @return predictionï¼š
    %       è¡Œå‘é‡1x3
    %           N(å¹³ç§»é¡¹æ•°), å‡æ–¹å·®ï¼Œ y(t+1)
    %
    len=length(y);
    S = []; % å‡æ–¹å·®
    output = [];
    for N = 2:floor(len*2/3)
        count=0;
        for i=N:len-1
            Mt = sum(y(i-N+1:i))/N;
            count = count + (y(i+1)-Mt)^2 ;
        end
        S = [S;N,(count/(len-N))^0.5];
        Mtout = sum(y(len-N+1:len)/N);
        output = [output;N,Mtout];
    end
    
    % ç»˜å›¾æ¯”è¾ƒ
    figure(99)
    title('ç®€å•ç§»åŠ¨å¹³å‡æ³•æ ‡å‡†å·®')
    plot(S(:,1),S(:,2),'-o');
    xlabel('N');ylabel('S');
    
    [x,y]=find(S==min(S(:,2))); 
    prediction = [N,min(S(:,2)),output(x,y)];  % æ³¨æ„prediction çš„ç»“æ„
    fprintf("N = %d\nprediction = %f",output(x,1),prediction);
end

function [prediction,params] = ExponentialSmoothing(y)
<<<<<<< HEAD
%%%%%%%%%%%%    Ö¸ÊıÆ½»¬·¨   %%%%%%%%%%%%
%     ÊÊÓÃ·¶Î§£º
%           Ö¸ÊıÆ½»¬·¨¸ù¾İÆ½»¬´ÎÊıµÄ²»Í¬£¬ÓÖ·ÖÎªÒ»´ÎÖ¸ÊıÆ½»¬·¨¡¢¶ş´ÎÖ¸ÊıÆ½»¬·¨ºÍÈı´ÎÖ¸ÊıÆ½»¬·¨
%     ÓÅÈ±µã£º
%           µ±·¢Õ¹Ç÷ÊÆ´æÔÚÆäËüµÄ±ä»¯£¬²ÉÓÃ¼òµ¥ÒÆ¶¯Æ½¾ù·¨¾Í»á²úÉú½Ï´óµÄÔ¤²âÆ«²îºÍÖÍºó¡£
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    % @function Ö¸ÊıÆ½»¬·¨
    %       ÊäÈë¹Û²ìĞòÁĞy£¬¼ÆËãalpha È¡0.1¡¢0.2¡¢...0.9¡¢1 µÄ½á¹û£¬ÒÀ¾İ¾ù·½²î×îĞ¡Ô­Ôò£¬Êä³ö×îÓÅ½â
=======
    %%%%%%%    æŒ‡æ•°å¹³æ»‘æ³•   %%%%%%%%%
    % é€‚ç”¨èŒƒå›´ï¼š
    %       æŒ‡æ•°å¹³æ»‘æ³•æ ¹æ®å¹³æ»‘æ¬¡æ•°çš„ä¸åŒï¼Œåˆåˆ†ä¸ºä¸€æ¬¡æŒ‡æ•°å¹³æ»‘æ³•ã€äºŒæ¬¡æŒ‡æ•°å¹³æ»‘æ³•å’Œä¸‰æ¬¡æŒ‡æ•°å¹³æ»‘æ³•
    % ä¼˜ç¼ºç‚¹ï¼š
    %       å½“å‘å±•è¶‹åŠ¿å­˜åœ¨å…¶å®ƒçš„å˜åŒ–ï¼Œé‡‡ç”¨ç®€å•ç§»åŠ¨å¹³å‡æ³•å°±ä¼šäº§ç”Ÿè¾ƒå¤§çš„é¢„æµ‹åå·®å’Œæ»åã€‚
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    % @function æŒ‡æ•°å¹³æ»‘æ³•
    %       è¾“å…¥è§‚å¯Ÿåºåˆ—yï¼Œè®¡ç®—alpha å–0.1ã€0.2ã€...0.9ã€1 çš„ç»“æœï¼Œä¾æ®å‡æ–¹å·®æœ€å°åŸåˆ™ï¼Œè¾“å‡ºæœ€ä¼˜è§£
>>>>>>> f92c044ecdee66bf80d6b2c4905686b79504e842
    %
    % @param yï¼š
    %       è§‚æµ‹åºåˆ—ï¼Œåˆ—å‘é‡nx1
    %
    % @return predictionï¼š
    %       æ•°æ®çŸ©é˜µ prediction = 3x3 
    %       è¾“å‡ºä¸€ã€äºŒã€ä¸‰æ¬¡æŒ‡æ•°æ¨¡å‹æœ€ä¼˜è§£
    %           alpha1ï¼Œå‡æ–¹å·®1ï¼Œy1ï¼ˆt+1ï¼‰
    %           alpha2ï¼Œå‡æ–¹å·®2ï¼Œy2ï¼ˆt+1ï¼‰
    %           alpha3ï¼Œå‡æ–¹å·®3ï¼Œy3ï¼ˆt+1ï¼‰
    %
    % @return params:
    %       å…ƒç»„ params
    %       è¾“å‡ºäºŒã€ä¸‰æ¬¡æŒ‡æ•°æ¨¡å‹çš„ç³»æ•°
    %           a2,b2
    %           a3,b3,c3
    %       å¯¹åº”æ¨¡å‹ï¼š
    %       y(t+T) = a2 + b2*T;
    %       y(t+T) = a3 + b3*T + c3*T^2;
    
    output = zeros([3,length(y)]); % ç¬¬t+1é¡¹
    S = zeros([3,length(y)]); % å‡æ–¹å·®
    St_end = zeros(3,10); % ç¬¬tä¸ªå¹³æ»‘é¡¹
    len=length(y);
<<<<<<< HEAD
    for j = 1:10
        alpha = j/10;
        St1 = zeros([1,len(y)]); % Ò»´ÎÆ½»¬Ïî
        St2 = zeros([1,len(y)]); % ¶ş´ÎÆ½»¬Ïî
        St3 = zeros([1,len(y)]); % Èı´ÎÆ½»¬Ïî
=======
    for alpha = 0.1:0.1:1
        St1 = zeros([1,len(y)]); % ä¸€æ¬¡å¹³æ»‘é¡¹
        St2 = zeros([1,len(y)]); % äºŒæ¬¡å¹³æ»‘é¡¹
        St3 = zeros([1,len(y)]); % ä¸‰æ¬¡å¹³æ»‘é¡¹
>>>>>>> f92c044ecdee66bf80d6b2c4905686b79504e842
        St1_0 = sum(y(1:4))/4; 
        St2_0 = St1_0;
        St3_0 = St2_0;  % åˆå§‹å€¼ï¼Œå–å‰å‡ é¡¹å‡å€¼
        for i = 1:len(y)
            if i==1
                St1(i) = alpha*y(i)+(1-alpha)*St1_0;
                St2(i) = alpha*St1(i)+(1-alpha)*St2_0;
                St3(i) = alpha*St2(i)+(1-alpha)*St3_0;
            else
                St1(i) = alpha*y(i)+(1-alpha)*St1(i-1);
                St2(i) = alpha*St1(i)+(1-alpha)*St2(i-1);
                St3(i) = alpha*St2(i)+(1-alpha)*St3(i-1);
            end
        end
        yt1 = St1(end);
        yt2 = (1+1/(1-alpha))*St1(end)-St2(end)/(1-alpha);
        yt3 = ((3-3*alpha+alpha^2)/(1-alpha)^2)*St1(end)-((3-alpha)/(1-alpha)^2)*St2(end)+St3(end)/(1-alpha)^2;
        output(:,j)=[yt1;yt2;yt3]; % Ã¿Ò»ÁĞ¶ÔÓ¦Ò»¸öalpha
        
        S(1,j) = (sum((St1-y').^2)/len)^0.5;
        S(2,j) = (sum((St2-y').^2)/len)^0.5;
        S(3,j) = (sum((St3-y').^2)/len)^0.5;
  
        St_end(:,j)= [St1;St2;St3];% Ã¿Ò»ÁĞ¶ÔÓ¦Ò»¸öalpha
    end
    
    a2 = 2*St_end(:,1) - St_end(:,2);
    b2 = alpha/(1-alpha)*(St_end(:,1) - St_end(:,2));
    param2 = [a2;b2];
    
    a3 = 3*St_end(:,1) - 3*St_end(:,2) + St_end(:,3);
    b3 = alpha/(2*(1-alpha)^2) * ( (5-6*alpha)*St_end(:,1)- 2*(5-4*alpha)*St_end(:,1) +(4-3*alpha)*St_end(:,1));
    c3 = alpha^2/(2*(1-alpha)^2) * (St_end(:,1) - 2*St_end(:,2) + St_end(:,3));
    param3 = [a3;b3;c3];
    
    % ç»˜å›¾æ¯”è¾ƒ
    figure(98)
    title('æŒ‡æ•°å¹³æ»‘æ³•æ ‡å‡†å·®');hold on;
    for i=1:3
        plot(0.1:0.1:1,S(i,:),'-o');
    end
    legend('ä¸€æ¬¡','äºŒæ¬¡','ä¸‰æ¬¡')
    xlabel('alpha');ylabel('S');
    
    prediction = zeros([3,3]); 
    % æ•°æ®çŸ©é˜µ
    % prediction = 3x3 
    % è¾“å‡ºä¸€ã€äºŒã€ä¸‰æ¬¡æŒ‡æ•°æ¨¡å‹æœ€ä¼˜è§£
    %   alpha1ï¼Œå‡æ–¹å·®1ï¼Œy1ï¼ˆt+1ï¼‰
    %   alpha2ï¼Œå‡æ–¹å·®2ï¼Œy2ï¼ˆt+1ï¼‰
    %   alpha3ï¼Œå‡æ–¹å·®3ï¼Œy3ï¼ˆt+1ï¼‰
    % 
    for i=1:3
        [x,y]=find(S==min(S(i,:)));
        prediction(i,1) = x/10; %%%%%%%%%%%%%%%% À©Õ¹ÏŞÖÆ
        prediction(i,2) = min(S(i,:));
        prediction(i,3) = output(x,y);
    end
<<<<<<< HEAD
    params = {param2(:,prediction(2,1)*10)';param3(:,prediction(3,1)*10)'}; %%%%%%%%%%%%% À©Õ¹ÏŞÖÆ
    % Ôª×é
=======
    params = {param2(:,prediction(2,1)*10)';param3(:,prediction(3,1)*10)'};
    % å…ƒç»„
>>>>>>> f92c044ecdee66bf80d6b2c4905686b79504e842
    % params
    %   a2ï¼Œb2
    %   a3, b3, c3
    %
    
end

<<<<<<< HEAD
function prediction = DifferenceExponentialSmoothing(y)
%%%%%%%%%%%%%%   ²î·ÖÖ¸ÊıÆ½»¬·¨  %%%%%%%%%%%%%%%
%     µ±Ê±¼äĞòÁĞµÄ±ä¶¯¾ßÓĞÖ±ÏßÇ÷ÊÆÊ±£¬ÓÃÒ»´ÎÖ¸ÊıÆ½»¬·¨»á³ö
%     ÏÖÖÍºóÆ«²î£¬ÆäÔ­ÒòÔÚÓÚÊı¾İ²»Âú×ãÄ£ĞÍÒªÇó¡£Òò´Ë£¬ÎÒÃÇÒ²¿ÉÒÔ´ÓÊı¾İ±ä»»µÄ½Ç¶ÈÀ´
%     ¿¼ÂÇ¸Ä½ø´ëÊ©£¬¼´ÔÚÔËÓÃÖ¸ÊıÆ½»¬·¨ÒÔÇ°ÏÈ¶ÔÊı¾İ×÷Ò»Ğ©¼¼ÊõÉÏµÄ´¦Àí£¬Ê¹Ö®ÄÜÊÊºÏÓÚ
%     Ò»´ÎÖ¸ÊıÆ½»¬Ä£ĞÍ£¬ÒÔºóÔÙ¶ÔÊä³ö½á¹û×÷¼¼ÊõÉÏµÄ·µ»Ø´¦Àí£¬Ê¹Ö®»Ö¸´ÎªÔ­±äÁ¿µÄĞÎÌ¬¡£
%     ²î·Ö·½·¨ÊÇ¸Ä±äÊı¾İ±ä¶¯Ç÷ÊÆµÄ¼òÒ×·½·¨¡£
%
%     µ±Ê±¼äĞòÁĞ³ÊÖ±ÏßÔö¼ÓÊ±£¬¿ÉÔËÓÃÒ»½×²î·ÖÖ¸ÊıÆ½»¬Ä£ĞÍÀ´Ô¤²â¡£
%     µ±Ê±¼äĞòÁĞ³ÊÏÖ¶ş´ÎÇúÏßÔö³¤Ê±£¬¿ÉÓÃ¶ş½×²î·ÖÖ¸ÊıÆ½»¬Ä£ĞÍÀ´Ô¤²â
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    % function £º²î·ÖÖ¸ÊıÆ½»¬·¨
    %       Êä³ö×îÓÅÏÈ½â
    %       
    % @param y: ¹Û²ìĞòÁĞ£¬ÁĞÏîÁ¿£¬nx1
    %
    % @return prediction£º
    %
    % @return params£º
    %
    len = length(y);
    % Ò»½×²î·Ö
    d_y = zeros([10,len]);
    d_y1 = zeros([10,len+1]);
    % ¶ş½×²î·Ö
    d2_y = zeros([10,len]);
    d2_y2 = zeros([10,len+1]);
    % Ô¤²âÖµ
    yt1 = zeros([10,len+1]);
    yt2 = zeros([10,len+1]);
    % Ô¤²âÖµ
    % Ã¿Ò»ĞĞÎª¶ÔÓ¦µÄÒ»¸öalphaÏÂµÄÒ»×éÔ¤²âÖµ
    %
    for i = 1:10
        alpha = i/10;
        for t = 2:len
            d_y(i,t) = y(t)-y(t-1);
            d2_y(i,t) = d_y(i,t) - d_y(i,t-1);
            
            d_y1(i,t+1) = alpha*d_y(i,t)+(1-alpha)*d_y1(i,t);
            d2_y2(i,t+1) = alpha*d2_y(i,t)+(1-alpha)*d2_y2(i,t);
            
            yt1(i,t+1) = d_y1(i,t+1) + y(t);
            yt2(i,t+1) = d2_y2(i,t+1) + d_y(i,t) + y(t);
        end
    end
    S1 = (yt1(:,3:end-1)-y(3:end)').^2./(len-2);
    S2 = (yt2(:,3:end-1)-y(3:end)').^2./(len-2);
    S1 = sum(S1'); % ¾ù·½²î£¬ĞĞÏòÁ¿
    S2 = sum(S2'); % ¾ù·½²î£¬ĞĞÏòÁ¿
    
    % »æÍ¼±È½Ï
    figure(97);
    hold on;
    for i = 1:2
        plot(1:10,S1,'-o');
    end
    legend('Ò»´Î²î·Ö','¶ş´Î²î·Ö')
    
    [~,y1]=find(S1==min(S1));
    [~,y2]=find(S2==min(S2));
    prediction = [y1/10,min(S1),yt1(y1,end);y2/10,min(S2),yt2(y2,end)];
    % Êı¾İ¾ØÕó2x3
    %   alpha1, ¾ù·½²î1£¬y(t+1)
    %   alpha2, ¾ù·½²î2£¬y(t+1)
    
end
=======
function DifferenceExponentialSmoothing(y)
%
%
>>>>>>> f92c044ecdee66bf80d6b2c4905686b79504e842

function [predication, W] = AdaptiveFiltering(y,N)
%%%%%%%%%%  ×ÔÊÊÓ¦ÂË²¨·¨ %%%%%%%%%%
%
%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%   N=2Ê±
%   y(t+1) = w(1)*y(t) + w(2)*y(t-1)

    if N==0
        N=2; % È¨ÖØ¸öÊı
    end
    len=length(y); 
    k=0.9; % Ñ§Ï°³£Êı
    
    diff=10000;
    W = ones(1,N)/N;
    while abs(diff)>0.0001
        diff=[];
        for j=N+1:len-1
            predication(j)= W * y(j-1:-1:j-N)';
            d = abs(y(j)-predication(j));
            diff=[diff,d];
            W = W + 2 * k * d *y(j-1:-1:j-N);
        end
        diff=max(diff);
    end
    fprintf("×î´ó²îÖµ = %f",diff);
end



