%
% y = ?0 + ?1*x + epsilon
% E(epsilon) = 0
% D(epsilon) = sigma
%
% 一元线性回归分析的主要任务是：
%       1、用试验值（样本值）对 ?0、?1 和 sigma 作点估计；
%       2、对回归系数 ?0、?1 作假设检验；
%       3、在 x=0处对 y 作预测，对 y 作区间估

% 一、模型参数估计
%       1.回归系数的最小二乘估计
%       2. sigma 的无偏估计

% 二、检验、预测、控制
%       1、回归方程的显著性检验
%           F检验法
%           t检验法
%           r检验法
%       2、回归系数的置信区间
%           预测
%           控制
%       3、通常选择的六类曲线
%           双曲线 ->
%           幂函数曲线 ->
%           指数曲线 -> 
%           倒指数曲线 ->
%           对数曲线 ->
%           S 型曲线 ->
  
% 多元线性分析
%     1、确定回归系数的点估计值：
%     2、求回归系数的点估计和区间估计、并检验回归模型
%     3、画出残差及其置信区间
%     
    